In [1]:
# importando biblioteca
import pandas as pd

In [2]:
# split cria uma lista identada
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [3]:
# Criando data frame
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [4]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [5]:
# visualizando a coluna c1
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [6]:
# verificando tipo
type(df['c1'])

pandas.core.series.Series

In [7]:
#selecionando mais de uma coluna como um dataframe
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [8]:
type(df[['c3', 'c1']])

pandas.core.frame.DataFrame

In [11]:
#seleção por linha
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [12]:
# selecionando linha e qual coluna
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [13]:
# usando loc para visualizar as linhas
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [14]:
# visualizando mais de uma linha
df.loc[['l3', 'l4']]

    c1  c2  c3  c4
l3   8  10  11  12
l4  13  14  15  16

In [15]:
# verificando o valor da l1 e da c2
df.loc['l1', 'c2']

2

In [17]:
# usando iloc. A diferença é que no iloc devemos usar o indice numerico das linhas e das colunas. Nesse caso apontamos para l1 e c2
df.iloc[0,1]

2

In [19]:
# selecionando duas linhas e duas colunas
df.loc[['l3','l4'], ['c3', 'c4']]

    c3  c4
l3  11  12
l4  15  16

In [21]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [22]:
# selecionando duas linhas e duas colunas. AGora com iloc
df.iloc[[2, 3], [2,3]]

    c3  c4
l3  11  12
l4  15  16